Revit 2027 API
ViewSchedule.GetSegmentCount Method
 Gets the total count of schedule segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSegmentCount()
Public Function GetSegmentCount As Integer
public:
int GetSegmentCount()
member GetSegmentCount : unit -> int
Return Value
Int32
 The total count of schedule segments. 1 means the schedule is not split yet.
Remarks
 There will be at least one segment for a schedule.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace